src/cf/Catalogs/СостоянияЧатБота.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СостоянияЧатБота</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Высказывание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступноИзЛюбогоСостояния</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЗаполняемогоПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевыеСлова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримерЗаполняемогоПараметра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСостоянийЧатБота</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПапкиФайлов</v8:Type>
								<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ТипыСостоянийЧатБота.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыСостоянийЧатБота</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высказывание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вопрос</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/СостоянияЧатБота/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	КлючевыеСлова = "";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ДополнительныеСвойства.Вставить("ЭтоНовый", Ложь);
		ПредыдущиеЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
			"Используется, Ссылка");
	Иначе
		ДополнительныеСвойства.Вставить("ЭтоНовый", Истина);
		ПредыдущиеЗначенияРеквизитов = Новый Структура;
		ПредыдущиеЗначенияРеквизитов.Вставить("Используется", Ложь);
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ПредыдущийИспользуется", ПредыдущиеЗначенияРеквизитов.Используется);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПредыдущийИспользуется") 
		И Используется <> ДополнительныеСвойства.ПредыдущийИспользуется Тогда 
		ОбновитьАктивностьЗависимыхСостояний(Ссылка, Родитель, Используется);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт 
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("Действие") Тогда
		Действие = ДанныеЗаполнения.Действие;
		КлючевыеСлова = ДанныеЗаполнения.КлючевыеСлова;
		Высказывание = ДанныеЗаполнения.Высказывание;
		ИмяЗаполняемогоПараметра = ДанныеЗаполнения.ИмяЗаполняемогоПараметра;
		ПримерЗаполняемогоПараметра = ДанныеЗаполнения.ПримерЗаполняемогоПараметра;
		Используется = Истина;
		
		Для Каждого Параметр Из ДанныеЗаполнения.Параметры Цикл
		
			Строка = Параметры.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, Параметр);
		
		КонецЦикла; 
		
		Если ЗначениеЗаполнено(ИмяЗаполняемогоПараметра) 
			И ЗначениеЗаполнено(ПримерЗаполняемогоПараметра) Тогда
		
			ТипСостояния = Перечисления.ТипыСостоянийЧатБота.Вопрос;
			
		ИначеЕсли ЗначениеЗаполнено(Действие) Тогда
			
			ТипСостояния = Перечисления.ТипыСостоянийЧатБота.Действие;
			
		Иначе
			
			ТипСостояния = Перечисления.ТипыСостоянийЧатБота.Высказывание;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не РодительЗаданКорректно(Родитель) Тогда
		Отказ = Истина;
		ТекстПредупреждения = Нстр("ru = 'Недопустимо указывать предопределенный элемент в качестве родителя'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения,, "Родитель", "Объект");
	КонецЕсли; 
	
	Если ТипСостояния = Перечисления.ТипыСостоянийЧатБота.Действие
		И Не ЗначениеЗаполнено(Действие) Тогда
		ПроверяемыеРеквизиты.Добавить("Действие");
	КонецЕсли;
	
	Если ТипСостояния = Перечисления.ТипыСостоянийЧатБота.Высказывание
		И Не ЗначениеЗаполнено(Высказывание) Тогда
		ПроверяемыеРеквизиты.Добавить("Высказывание");
	КонецЕсли;
	
	РодительТип = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "ТипСостояния");
	
	Если РодительТип = Перечисления.ТипыСостоянийЧатБота.Вопрос 
		И Не ЭтоЕдинственноеПодчиненноеСостояние(Ссылка, Родитель) Тогда
		Отказ = Истина;
		ТекстПредупреждения = НСтр("ru = 'Для типа состояния ""Вопрос"" уже задано подчиненное состояние'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения,, "ТипСостояния", "Объект");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьАктивностьЗависимыхСостояний(Ссылка, Родитель, ЗначениеИспользуется)
	
	СостоянияДляОбновления = Новый ТаблицаЗначений();
	СостоянияДляОбновления.Колонки.Добавить("Ссылка");
	
	Если ЗначениеИспользуется Тогда
		Если ЗначениеЗаполнено(Родитель) Тогда 
			СостояниеДляОбновления = СостоянияДляОбновления.Добавить();
			СостояниеДляОбновления.Ссылка = Родитель;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Ссылка) Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СостоянияЧатБота.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СостоянияЧатБота КАК СостоянияЧатБота
			|ГДЕ
			|	СостоянияЧатБота.Ссылка В ИЕРАРХИИ(&ТекущееСостояние)
			|	И СостоянияЧатБота.Используется = ИСТИНА
			|	И СостоянияЧатБота.Ссылка <> &ТекущееСостояние";
		Запрос.Параметры.Вставить("ТекущееСостояние", Ссылка);
		СостоянияДляОбновления = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Для Каждого Состояние Из СостоянияДляОбновления Цикл
		СостояниеОбъект = Состояние.Ссылка.ПолучитьОбъект();
		СостояниеОбъект.Используется = Используется;
		СостояниеОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция РодительЗаданКорректно(Ссылка)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Предопределенный") <> Истина;
	
КонецФункции

Функция ЭтоЕдинственноеПодчиненноеСостояние(Ссылка, Родитель)
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Родитель", Родитель);
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостоянияЧатБота.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СостоянияЧатБота КАК СостоянияЧатБота
		|ГДЕ
		|	СостоянияЧатБота.Родитель = &Родитель
		|	И СостоянияЧатБота.Ссылка <> &Ссылка
		|	И СостоянияЧатБота.ПометкаУдаления = ЛОЖЬ";
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
